# Bootstrapping
# NOTE: This is required in bootstraping dotfiles
brew 'ansible' 

# Install Terminal Utilities
#cask 'ghostty'
brew 'tmux'

# Install Development Utilities
brew 'git'
tap 'neovim/neovim' || true
brew 'neovim'
## Containers
brew 'podman'
brew 'podman-compose'
cask 'podman-desktop'

# Install CLI Utilities
brew 'fd'            # Replacement for file, 'fd' binary
brew 'ripgrep'       # Replacement for grep, 'rg' binary
brew 'gnupg'
brew 'tre-command'   # Replacement for tree, 'tre' binary
cask '1password-cli' # Installs 'op' binary
brew 'git-crypt'

## Cloud CLI Utilities
brew 'awscli'
brew 'kopia'   # local storage to cloud backups
cask 'kopiaui' # local storage to cloud backups UI

# Static Site Generators
brew 'zola'
brew 'hugo'

# Install Network Utilities
brew "mtr"
brew "nmap"
brew 'sipcalc'

# Install Languages
brew 'go'
brew 'python3'
brew 'java'

# Install Language Tools
## Python
brew 'python-tk'        # prevents error when compiling different python versions with pyenv
brew 'pyenv-virtualenv' # all python packages in a virtualenv
brew 'pipx'
## Java
brew 'jenv'

# Hashicorp
tap 'hashicorp/tap'
brew 'hashicorp/tap/packer'
brew 'hashicorp/tap/terraform'
brew 'hashicorp/tap/vault'
## Hashicorp Adjacent
brew 'terragrunt'
brew 'opentofu'

# k8s
brew 'kubectl'
brew 'kustomize'
brew 'kubectx'
brew 'kubecolor'
## k8s Talos
tap 'siderolabs/tap'
brew 'talosctl'
## k8s cli
brew 'k9s'
brew 'helm'
## k8s deployed tools
brew 'argo'
brew 'argocd'
brew 'cmctl' # Cert Manager CLI

# YAML Tools
tap 'carvel-dev/carvel'
brew 'ytt'
brew 'yq'

# JSON Tools
brew 'jsonnet'
brew 'jq'

# Shell
brew 'zsh'
brew 'sheldon'
